# dotfiles/Brewfile

cask_args appdir: '/Applications'

#Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
tap "caskroom/versions"

#Applications
cask "1password"
cask "alfred"
cask "bettertouchtool"
cask "emacs"
cask "evernote"
cask "firefox"
cask "forklift"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "telegram"
cask "transmission"
cask "fliqlo"
cask "java8"
cask "slack"

#Binaries/Libraries
brew "python3"
brew "postgresql"
brew "ripgrep"
brew "node"
brew "yarn", args: ["without-node"]
brew "clojure"
