# dotfiles/Brewfile

cask_args appdir: '/Applications'

#Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

#Binaries/Libraries
brew "gettext", link: true
brew "nvm"
brew "postgresql", restart_service: true
brew "pyenv"
brew "yarn", args: ["without-node"]
brew "zsh"

#Applications
cask "atom"
cask "bettertouchtool"
cask "calibre"
cask "firefox"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-monoid"
cask "google-chrome"
cask "hyper"
cask "kindle-comic-converter"
cask "kindlegen"
cask "pycharm"
cask "send-to-kindle"
cask "transmission"
cask "visual-studio-code"
cask "webstorm"


